In [15]:
import numpy as np
import pandas as pd
import seaborn as sns

In [16]:
data=pd.read_csv(r"C:\Users\admin\Downloads\bank_transactions.csv")

In [17]:
data.head

<bound method NDFrame.head of       TransactionID CustomerID CustomerDOB CustGender CustLocation  \
0                T1   C5841053  10-01-1994          F   JAMSHEDPUR
1                T2   C2142763  04-04-1957          M      JHAJJAR
2                T3   C4417068  26-11-1996          F       MUMBAI
3                T4   C5342380  14-09-1973          F       MUMBAI
4                T5   C9031234  24-03-1988          F  NAVI MUMBAI
...             ...        ...         ...        ...          ...
19995        T19996   C2130963  09-08-1989          M       MUMBAI
19996        T19997   C1214583  02-01-1987          M      KOLKATA
19997        T19998   C4739783  11-02-1970          M       MUMBAI
19998        T19999   C4532552  21-02-1993          M        DELHI
19999        T20000   C6936463  27-08-1987          F     VADODARA

       CustAccountBalance TransactionDate  TransactionTime  \
0                17819.05      02-08-2016           143207
1                 2270.69      02-08-2016           141858
2                17874.44      02-08-2016           142712
3               866503.21      02-08-2016           142714
4                 6714.43      02-08-2016           181156
...                   ...             ...              ...
19995             9961.78      23-09-2016           115919
19996             7120.57      23-09-2016           115831
19997           118130.78      23-09-2016           193238
19998            13226.06      23-09-2016           195759
19999           381571.91      23-09-2016           195800

       TransactionAmount (INR)
0                         25.0
1                      27999.0
2                        459.0
3                       2060.0
4                       1762.5
...                        ...
19995                     47.0
19996                    300.0
19997                   3400.0
19998                    500.0
19999                    270.0

[20000 rows x 9 columns]>

In [18]:
data.shape

(20000, 9)

In [19]:
data.ndim

2

In [20]:
data.columns

Index(['TransactionID', 'CustomerID', 'CustomerDOB', 'CustGender',
       'CustLocation', 'CustAccountBalance', 'TransactionDate',
       'TransactionTime', 'TransactionAmount (INR)'],
      dtype='object')

In [21]:
data.value_counts("CustLocation")

CustLocation
MUMBAI                       1994
NEW DELHI                    1628
BANGALORE                    1575
DELHI                        1371
GURGAON                      1363
                             ...
KARMANGHAT RANGAREDDI           1
KARKALA                         1
KARJAT RAIGAD                   1
KARAMSAD                        1
ZONE WHITEFIELD BANGALORE       1
Name: count, Length: 1781, dtype: int64

In [23]:
data=data.drop(["TransactionID","CustomerDOB"],axis=1)

In [24]:
data.head()

,CustomerID,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
0,C5841053,F,JAMSHEDPUR,17819.05,02-08-2016,143207,25.0
1,C2142763,M,JHAJJAR,2270.69,02-08-2016,141858,27999.0
2,C4417068,F,MUMBAI,17874.44,02-08-2016,142712,459.0
3,C5342380,F,MUMBAI,866503.21,02-08-2016,142714,2060.0
4,C9031234,F,NAVI MUMBAI,6714.43,02-08-2016,181156,1762.5

In [25]:
data['TransactionDate']=pd.to_datetime(data['TransactionDate'],format='%d-%m-%Y')

In [26]:
data.head()

,CustomerID,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
0,C5841053,F,JAMSHEDPUR,17819.05,2016-08-02,143207,25.0
1,C2142763,M,JHAJJAR,2270.69,2016-08-02,141858,27999.0
2,C4417068,F,MUMBAI,17874.44,2016-08-02,142712,459.0
3,C5342380,F,MUMBAI,866503.21,2016-08-02,142714,2060.0
4,C9031234,F,NAVI MUMBAI,6714.43,2016-08-02,181156,1762.5

In [27]:
data.dropna(inplace=True)
#drop rows with missing values
#inplace= true makes the temporary function permanent

In [28]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 19961 entries, 0 to 19999
Data columns (total 7 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   CustomerID               19961 non-null  object
 1   CustGender               19961 non-null  object
 2   CustLocation             19961 non-null  object
 3   CustAccountBalance       19961 non-null  float64
 4   TransactionDate          19961 non-null  datetime64[ns]
 5   TransactionTime          19961 non-null  int64
 6   TransactionAmount (INR)  19961 non-null  float64
dtypes: datetime64[ns](1), float64(2), int64(1), object(3)
memory usage: 1.2+ MB

In [29]:
data.describe()

,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
count,1.996100e+04,19961,19961.000000,19961.000000
mean,1.210576e+05,2016-09-28 08:35:39.692400128,175408.292721,1720.189670
min,0.000000e+00,2016-08-01 00:00:00,400.000000,0.000000
25%,5.522240e+03,2016-09-25 00:00:00,152843.000000,150.000000
50%,1.925520e+04,2016-09-26 00:00:00,184615.000000,420.000000
75%,6.471620e+04,2016-09-27 00:00:00,203636.000000,1149.000000
max,5.099967e+07,2016-10-21 00:00:00,235951.000000,455122.000000
std,7.260114e+05,NaN,38272.663313,7197.801948

In [56]:
df=data.query("'TransactionAmount (INR)'<=1720")
df.head

TypeError: data type 'TransactionAmount (INR)' not understood

In [50]:
data['CustAccountBalance'].mean()

121057.6172040479

In [61]:
data['TransactionAmount (INR)'].mode()

0    100.0
Name: TransactionAmount (INR), dtype: float64

In [68]:
data.rename(columns={"TransactionAmount (INR)":"TransactionAmount"},inplace= True)

In [80]:
len(data.query("TransactionAmount>0.0 and TransactionAmount<=5000.0"))

18837